load-generator-tsung/tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="debug" version="1.0">

  <clients>
    <client host="localhost" weight="1" use_controller_vm="true" maxusers="100"/>
  </clients>

  <servers>
    <server host="entry-1" port="8080" type="tcp"></server>
  </servers>

  <load duration="10" unit="minute">
    <arrivalphase phase="2" duration="10" unit="minute">
      <users interarrival="2" unit="second"></users>
    </arrivalphase>
  </load>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">
      <request>
        <http url="/invoke?source=load-generator" method="GET" version="1.1"></http>
      </request>
    </session>
  </sessions>

</tsung>